CSI API ETABS v1
cAutoSeismic.SetIBC2006 Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetIBC2006(
	string Name,
	int DirFlag,
	double Eccen,
	int PeriodFlag,
	int CtType,
	double UserT,
	bool UserZ,
	double TopZ,
	double BottomZ,
	double R,
	double Omega,
	double Cd,
	double I,
	int IBC2006Option,
	double Latitude,
	double Longitude,
	string ZipCode,
	double Ss,
	double S1,
	double Tl,
	int SiteClass,
	double Fa,
	double Fv
)
Function SetIBC2006 (
	Name As String,
	DirFlag As Integer,
	Eccen As Double,
	PeriodFlag As Integer,
	CtType As Integer,
	UserT As Double,
	UserZ As Boolean,
	TopZ As Double,
	BottomZ As Double,
	R As Double,
	Omega As Double,
	Cd As Double,
	I As Double,
	IBC2006Option As Integer,
	Latitude As Double,
	Longitude As Double,
	ZipCode As String,
	Ss As Double,
	S1 As Double,
	Tl As Double,
	SiteClass As Integer,
	Fa As Double,
	Fv As Double
) As Integer
Dim instance As cAutoSeismic
Dim Name As String
Dim DirFlag As Integer
Dim Eccen As Double
Dim PeriodFlag As Integer
Dim CtType As Integer
Dim UserT As Double
Dim UserZ As Boolean
Dim TopZ As Double
Dim BottomZ As Double
Dim R As Double
Dim Omega As Double
Dim Cd As Double
Dim I As Double
Dim IBC2006Option As Integer
Dim Latitude As Double
Dim Longitude As Double
Dim ZipCode As String
Dim Ss As Double
Dim S1 As Double
Dim Tl As Double
Dim SiteClass As Integer
Dim Fa As Double
Dim Fv As Double
Dim returnValue As Integer
returnValue = instance.SetIBC2006(Name,
	DirFlag, Eccen, PeriodFlag, CtType,
	UserT, UserZ, TopZ, BottomZ, R, Omega,
	Cd, I, IBC2006Option, Latitude, Longitude,
	ZipCode, Ss, S1, Tl, SiteClass, Fa,
	Fv)
int SetIBC2006(
	String^ Name,
	int DirFlag,
	double Eccen,
	int PeriodFlag,
	int CtType,
	double UserT,
	bool UserZ,
	double TopZ,
	double BottomZ,
	double R,
	double Omega,
	double Cd,
	double I,
	int IBC2006Option,
	double Latitude,
	double Longitude,
	String^ ZipCode,
	double Ss,
	double S1,
	double Tl,
	int SiteClass,
	double Fa,
	double Fv
)
abstract SetIBC2006 :
        Name : string *
        DirFlag : int *
        Eccen : float *
        PeriodFlag : int *
        CtType : int *
        UserT : float *
        UserZ : bool *
        TopZ : float *
        BottomZ : float *
        R : float *
        Omega : float *
        Cd : float *
        I : float *
        IBC2006Option : int *
        Latitude : float *
        Longitude : float *
        ZipCode : string *
        Ss : float *
        S1 : float *
        Tl : float *
        SiteClass : int *
        Fa : float *
        Fv : float -> int
Parameters
Name
Type: System.String
DirFlag
Type: System.Int32
Eccen
Type: System.Double
PeriodFlag
Type: System.Int32
CtType
Type: System.Int32
UserT
Type: System.Double
UserZ
Type: System.Boolean
TopZ
Type: System.Double
BottomZ
Type: System.Double
R
Type: System.Double
Omega
Type: System.Double
Cd
Type: System.Double
I
Type: System.Double
IBC2006Option
Type: System.Int32
Latitude
Type: System.Double
Longitude
Type: System.Double
ZipCode
Type: System.String
Ss
Type: System.Double
S1
Type: System.Double
Tl
Type: System.Double
SiteClass
Type: System.Int32
Fa
Type: System.Double
Fv
Type: System.Double
Return Value
Type: Int32
See Also
Reference
cAutoSeismic Interface
ETABSv1 Namespace